In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

In [2]:
dataset=pd.read_csv("general_data.csv")
print(dataset)

      Age Attrition  ... YearsSinceLastPromotion YearsWithCurrManager
0      51        No  ...                       0                    0
1      31       Yes  ...                       1                    4
2      32        No  ...                       0                    3
3      38        No  ...                       7                    5
4      32        No  ...                       0                    4
...   ...       ...  ...                     ...                  ...
4405   42        No  ...                       0                    2
4406   29        No  ...                       0                    2
4407   25        No  ...                       1                    2
4408   42        No  ...                       7                    8
4409   40        No  ...                       3                    9

[4410 rows x 24 columns]

In [4]:
dataset_1=pd.read_csv("general_data.csv")
print(dataset_1)

      Age Attrition  ... YearsSinceLastPromotion YearsWithCurrManager
0      51        No  ...                       0                    0
1      31       Yes  ...                       1                    4
2      32        No  ...                       0                    3
3      38        No  ...                       7                    5
4      32        No  ...                       0                    4
...   ...       ...  ...                     ...                  ...
4405   42        No  ...                       0                    2
4406   29        No  ...                       0                    2
4407   25        No  ...                       1                    2
4408   42        No  ...                       7                    8
4409   40        No  ...                       3                    9

[4410 rows x 24 columns]

In [5]:
dataset.head()

   Age Attrition  ... YearsSinceLastPromotion YearsWithCurrManager
0   51        No  ...                       0                    0
1   31       Yes  ...                       1                    4
2   32        No  ...                       0                    3
3   38        No  ...                       7                    5
4   32        No  ...                       0                    4

[5 rows x 24 columns]

In [6]:
dataset_1.head(10)

   Age Attrition  ... YearsSinceLastPromotion YearsWithCurrManager
0   51        No  ...                       0                    0
1   31       Yes  ...                       1                    4
2   32        No  ...                       0                    3
3   38        No  ...                       7                    5
4   32        No  ...                       0                    4
5   46        No  ...                       7                    7
6   28       Yes  ...                       0                    0
7   29        No  ...                       0                    0
8   31        No  ...                       7                    8
9   25        No  ...                       1                    5

[10 rows x 24 columns]

In [7]:
dataset_1.tail()

      Age Attrition  ... YearsSinceLastPromotion YearsWithCurrManager
4405   42        No  ...                       0                    2
4406   29        No  ...                       0                    2
4407   25        No  ...                       1                    2
4408   42        No  ...                       7                    8
4409   40        No  ...                       3                    9

[5 rows x 24 columns]

In [8]:
dataset_1.columns

Index(['Age', 'Attrition', 'BusinessTravel', 'Department', 'DistanceFromHome',
       'Education', 'EducationField', 'EmployeeCount', 'EmployeeID', 'Gender',
       'JobLevel', 'JobRole', 'MaritalStatus', 'MonthlyIncome',
       'NumCompaniesWorked', 'Over18', 'PercentSalaryHike', 'StandardHours',
       'StockOptionLevel', 'TotalWorkingYears', 'TrainingTimesLastYear',
       'YearsAtCompany', 'YearsSinceLastPromotion', 'YearsWithCurrManager'],
      dtype='object')

In [9]:
dataset_1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4410 entries, 0 to 4409
Data columns (total 24 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   Age                      4410 non-null   int64
 1   Attrition                4410 non-null   object
 2   BusinessTravel           4410 non-null   object
 3   Department               4410 non-null   object
 4   DistanceFromHome         4410 non-null   int64
 5   Education                4410 non-null   int64
 6   EducationField           4410 non-null   object
 7   EmployeeCount            4410 non-null   int64
 8   EmployeeID               4410 non-null   int64
 9   Gender                   4410 non-null   object
 10  JobLevel                 4410 non-null   int64
 11  JobRole                  4410 non-null   object
 12  MaritalStatus            4410 non-null   object
 13  MonthlyIncome            4410 non-null   int64
 14  NumCompaniesWorked       4391 non-null   float64
 15  Over18                   4410 non-null   object
 16  PercentSalaryHike        4410 non-null   int64
 17  StandardHours            4410 non-null   int64
 18  StockOptionLevel         4410 non-null   int64
 19  TotalWorkingYears        4401 non-null   float64
 20  TrainingTimesLastYear    4410 non-null   int64
 21  YearsAtCompany           4410 non-null   int64
 22  YearsSinceLastPromotion  4410 non-null   int64
 23  YearsWithCurrManager     4410 non-null   int64
dtypes: float64(2), int64(14), object(8)
memory usage: 827.0+ KB

In [11]:
dataset_1["DistanceFromHome"].mean()

9.19251700680272

In [13]:
dataset_1[["DistanceFromHome","Education","MonthlyIncome"]].mean()

DistanceFromHome        9.192517
Education               2.912925
MonthlyIncome       65029.312925
dtype: float64

In [12]:
dataset_1[["DistanceFromHome","Education","MonthlyIncome"]].var()

DistanceFromHome    6.569144e+01
Education           1.048438e+00
MonthlyIncome       2.215480e+09
dtype: float64

In [14]:
dataset_1[["DistanceFromHome","Education","MonthlyIncome"]].std()

DistanceFromHome        8.105026
Education               1.023933
MonthlyIncome       47068.888559
dtype: float64

In [15]:
dataset_1[["DistanceFromHome","Education","MonthlyIncome"]].describe()

       DistanceFromHome    Education  MonthlyIncome
count       4410.000000  4410.000000    4410.000000
mean           9.192517     2.912925   65029.312925
std            8.105026     1.023933   47068.888559
min            1.000000     1.000000   10090.000000
25%            2.000000     2.000000   29110.000000
50%            7.000000     3.000000   49190.000000
75%           14.000000     4.000000   83800.000000
max           29.000000     5.000000  199990.000000

In [16]:
dataset_1[["DistanceFromHome","Education","MonthlyIncome"]].skew()

DistanceFromHome    0.957466
Education          -0.289484
MonthlyIncome       1.368884
dtype: float64

In [17]:
dataset_1[["DistanceFromHome","Education","DistanceFromHome"]].kurt()

DistanceFromHome   -0.227045
Education          -0.560569
MonthlyIncome       1.000232
dtype: float64

In [23]:
from scipy.stats import mannwhitneyu
a=dataset_1.DistanceFromHome
b=dataset_1.Education
stat, p=mannwhitneyu(a,b)
print(stat, p)

5503365.0 2.371790832392393e-279

In [28]:
from scipy.stats import ttest_ind
c=dataset_1.DistanceFromHome
d=dataset_1.Education
stat, p=ttest_ind(c,d)
print(stat, p)

51.04556450795624 0.0

In [29]:
from scipy.stats import pearsonr
stats, p=pearsonr(dataset_1.Attrition, dataset_1.YearsSinceLastPromotion)
print(stats, p)

TypeError: ignored